name: "ensemble_dali_flag_trt"
platform: "ensemble"
max_batch_size: 8
input [
    {
        name: "INPUT"
        data_type: TYPE_UINT8
        dims: [ -1, -1, 3 ]
    }
]
output [
    {
        name: "OUTPUT"
        data_type: TYPE_FP32
        dims: [ 6001, 1, 1 ]
    }
]
ensemble_scheduling {
    step [
        {
            model_name: "dali_yolov5_trt_prp"
            model_version: 1
            input_map {
                key: "DALI_INPUT_0"
                value: "INPUT"
            }
            output_map {
                key: "DALI_OUTPUT_0"
                value: "preprocessed_image"
            }
        },
        {
            model_name: "yolov5_flag_trt"
            model_version: 1
            input_map {
                key: "data"
                value: "preprocessed_image"
            }
            output_map {
                key: "prob"
                value: "OUTPUT"
            }
        }
    ]
}