name: "dali_yolov5_trt_prp"
backend: "dali"
max_batch_size: 8
input [
    {
        name: "DALI_INPUT_0"
        data_type: TYPE_UINT8
        dims: [ -1, -1, 3 ]
    }
]
output [
    {
        name: "DALI_OUTPUT_0"
        data_type: TYPE_FP32
        dims: [ 3, 640, 640 ]
    }
]
parameters: [
    {
        key: "num_threads"
        value: { string_value: "1" }
    }
]

default_model_filename: "model.dali"
